In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("pandas.practice.csv")

In [3]:
print(df)

   Order_ID        Date Customer_Name Region   Product  Quantity  Unit_Price  \
0      1001  05-01-2024      Riya Sen   East    Laptop         2       55000
1      1002  06-01-2024     Arjun Das   West     Mouse         5         800
2      1003  06-01-2024     Meera Roy  North  Keyboard         3        1500
3      1004  07-01-2024    Neha Singh  South   Monitor         1       12000
4      1005  07-01-2024      Riya Sen   East     Mouse         2         800
5      1006  08-01-2024   Vikram Jain  North    Laptop         1       55000
6      1007  08-01-2024     Sneha Das   West   Monitor         2       12000
7      1008  09-01-2024    Rahul Bose  South  Keyboard         4        1500
8      1009  09-01-2024     Arjun Das   West    Laptop         1       55000
9      1010  10-01-2024    Neha Singh  South     Mouse         3         800

   Total_Sales
0       110000
1         4000
2         4500
3        12000
4         1600
5        55000
6        24000
7         6000
8        55000
9         2400

In [4]:
df.head()

,Order_ID,Date,Customer_Name,Region,Product,Quantity,Unit_Price,Total_Sales
0,1001,05-01-2024,Riya Sen,East,Laptop,2,55000,110000
1,1002,06-01-2024,Arjun Das,West,Mouse,5,800,4000
2,1003,06-01-2024,Meera Roy,North,Keyboard,3,1500,4500
3,1004,07-01-2024,Neha Singh,South,Monitor,1,12000,12000
4,1005,07-01-2024,Riya Sen,East,Mouse,2,800,1600

In [5]:
df.tail()

,Order_ID,Date,Customer_Name,Region,Product,Quantity,Unit_Price,Total_Sales
5,1006,08-01-2024,Vikram Jain,North,Laptop,1,55000,55000
6,1007,08-01-2024,Sneha Das,West,Monitor,2,12000,24000
7,1008,09-01-2024,Rahul Bose,South,Keyboard,4,1500,6000
8,1009,09-01-2024,Arjun Das,West,Laptop,1,55000,55000
9,1010,10-01-2024,Neha Singh,South,Mouse,3,800,2400

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_ID       10 non-null     int64
 1   Date           10 non-null     object
 2   Customer_Name  10 non-null     object
 3   Region         10 non-null     object
 4   Product        10 non-null     object
 5   Quantity       10 non-null     int64
 6   Unit_Price     10 non-null     int64
 7   Total_Sales    10 non-null     int64
dtypes: int64(4), object(4)
memory usage: 772.0+ bytes

In [7]:
df.describe()

         Order_ID   Quantity    Unit_Price    Total_Sales
count    10.00000  10.000000     10.000000      10.000000
mean   1005.50000   2.400000  19440.000000   27450.000000
std       3.02765   1.349897  24922.733932   35614.517951
min    1001.00000   1.000000    800.000000    1600.000000
25%    1003.25000   1.250000    975.000000    4125.000000
50%    1005.50000   2.000000   6750.000000    9000.000000
75%    1007.75000   3.000000  44250.000000   47250.000000
max    1010.00000   5.000000  55000.000000  110000.000000

In [8]:
df.shape

(10, 8)

In [9]:
df.columns

Index(['Order_ID', 'Date', 'Customer_Name', 'Region', 'Product', 'Quantity',
       'Unit_Price', 'Total_Sales'],
      dtype='object')

In [8]:
df.dtypes

Order_ID          int64
Date             object
Customer_Name    object
Region           object
Product          object
Quantity          int64
Unit_Price        int64
Total_Sales       int64
dtype: object

In [9]:
df['Quantity']

0    2
1    5
2    3
3    1
4    2
5    1
6    2
7    4
8    1
9    3
Name: Quantity, dtype: int64

In [10]:
df[df['Quantity'] > 3]

,Order_ID,Date,Customer_Name,Region,Product,Quantity,Unit_Price,Total_Sales
1,1002,06-01-2024,Arjun Das,West,Mouse,5,800,4000
7,1008,09-01-2024,Rahul Bose,South,Keyboard,4,1500,6000